import { Translations } from "types/Translations";

const beTranslations: { translations: Translations } = {
  translations: {
    generics: {
      backToBeginning: 'Вярнуцца да пачатку',
      back: 'Назад',
      soon: 'Хутка будзе...',
      see: 'Глядзець'
    },
    footer: {
      copyrightMessage: '© 2024 International Virtual Aviation Organisation - IVAO Belarus. Усе правы ахоўваюцца.',
      privacyPolicyName: 'Палітыка прыватнасці',
      termsOfUseName: 'Умовы выкарыстання',
    },
    beta: {
      title: 'БЭТА СІСТЭМА',
      message: '𝗞𝗥𝗢𝗡𝗢𝗦 - гэта нядаўна запушчаная сістэма, якая пастаянна распрацоўваецца. Мы разлічваем на тое, што вы паведаміце аб любых выяўленых памылках.'
    },
    cookies: {
      title: 'Мы выкарыстоўваем файлы cookie, каб палепшыць ваш вопыт',
      subtitle: 'Нам патрэбны ваш дазвол, каб працягваць рабіць гэтыя цудоўныя імбірныя смачнасці!',
      authorizeUse: 'Так, я згодзен!',
      continueWithout: 'Не люблю печыва',
    },
    errors: {
      general: {
        title: 'Х\'юстан, у нас праблема! 💥',
        subtitle: 'Нам вельмі шкада, але нашы сістэмы паказваюць на збоі ў навігацыйным кампутары. Перазагрузіце старонку або паўтарыце пазней.',
      },
      notFound: {
        title: "О, не... Гэтая старонка была выкрадзена масонамі! 👽",
        subtitle: 'Здаецца, вы дасягнулі мяжы нашага сусвету, або старонка, на якую вы звярталіся, не знойдзена.'
      },
      admin: {
        noAdmin: 'Вы не адміністратар.',
        eventFinished: 'Гэта падзея скончылася, і яе нельга рэдагаваць.',
        wrongDivision: 'Гэта падзея не з вашага дывізіёну.',
        isActive: 'Гэта падзея актыўная і не можа быць адрэдагавана.',
        updateAdmin: 'Вы не можаце рэдагаваць іншага адміністратара.',
        updateYourself: 'Вы не можаце рэдагаваць сябе.'
      },
      book: {
        suspended: 'Вы прыпынены ў сістэме і не можаце забраніраваць.',
        notOwner: 'Вы не з\'яўляецеся ўладальнікам гэтага слота.',
        notActive: 'Гэта падзея не актыўная.',
        tooEarly: 'Гэты слот можа быць пацверджаны толькі за 7 дзён да падзеі.',
        alreadyBusy: 'У вас ужо ёсць слот, забраніраваны на той жа час.',
        hasStarted: 'Гэта падзея ўжо пачалася.',
        hasEnded: 'Гэта падзея ўжо скончылася.',
        notFound: 'Слот не знойдзены.',
        duplicateNumber: 'Рэйс з такім жа нумарам ужо ёсць.',
        notPreBooked: 'Вы не можаце пацвердзіць слот, які не забраніраваны.'
      },
      auth: {
        error: 'Памылка аўтэнтыфікацыі карыстальніка.'
      },
      event: {
        notFound: 'Падзея не знойдзена.'
      },
      scenery: {
        notFound: 'Сцэнарый не знойдзены.'
      },
      aircraft: {
        notFound: 'Самалёт не знойдзены.'
      },
      user: {
        notFound: 'Карыстальнік не знойдзены.'
      },
      airport: {
        notFound: 'Мы не змаглі знайсці аэрапорт, з якога вы спрабуеце ляцець. Праверце коды ICAO і паўтарыце спробу.'
      },
    },
    splash: {
      title: 'Паспрабуйце лепшае, што можа прапанаваць сімулятар палёту!',
      subtitle: 'Кіруйце сваімі браніраваннямі сучасным, хуткім і інтуітыўна зразумелым спосабам.',
      explore: 'Даследуйце рэйсы!'
    },
    events: {
      found_zero: 'Тут няма падзей, праверце яшчэ раз пазней.',
      found_one: '{{ count }} падзея знойдзена',
      found_other: '{{ count }} падзей знойдзена',
      soon: 'Хутка будзе...'
    },
    info: {
      pilotBriefing: {
        title: 'Брыфінг пілота',
        description: 'У гэтым дакуменце ўтрымліваюцца рэкамендацыі для пілотаў аб канкрэтных працэдурах для гэтай падзеі. Неабходна прачытаць.',
      },
      atcBriefing: {
        title: 'Брыфінг КПР',
        description: 'Гэты дакумент змяшчае рэкамендацыі для дыспетчараў паветранага руху аб канкрэтных працэдурах для гэтай падзеі. Прачытаць яго трэба.',
      },
      sceneries: {
        title: 'Сцэнарыі',
        description: 'Тут вы можаце знайсці рэкамендаваныя сцэнарыі для гэтай падзеі.',
        sims: {
          fs9: {
            description: 'Microsoft Flight Simulator 2004: A Century of Flight - сімулятар палёту, выпушчаны ў 2003 годзе і з\'яўляецца часткай серыі сімулятараў Microsoft Flight Simulator.'
          },
          fsx: {
            description: 'Microsoft Flight Simulator X - сімулятар палёту 2006 года, першапачаткова распрацаваны Aces Game Studio і выдадзеная Microsoft Game Studios для Microsoft Windows.'
          },
          p3d: {
            description: 'Prepar3D - гэта платформа візуальнага мадэлявання, якая дазваляе карыстальнікам ствараць сцэнарыі трэніровак у авіяцыйнай, марской і наземнай сферах.'
          },
          msfs: {
            description: 'Microsoft Flight Simulator - гэта аматарскі сімулятар палёту, распрацаваны Asobo Studio і апублікаваны Xbox Game Studios. Гэта частка серыі Microsoft Flight Simulator, якая пачалася ў 1982 годзе, і ёй папярэднічаў Microsoft Flight Simulator X у 2006 годзе.'
          },
          xp11: {
            description: 'X-Plane 11 - гэта падрабязны, рэалістычны і сучасны сімулятар, якога вы так доўга чакалі.'
          }
        },
      },
    },
    flights: {
      search: 'Пошук палётаў',
      arrivals: 'Прыбыцці',
      departures: 'Вылеты',
      privateSlots: 'Прыватныя слоты',
      flightNumber: 'Нумар рэйса',
      eobt: 'EOBT',
      gate: 'Стаянка',
      bookFlight: 'Забраніраваць рэйс',
      loadMore: 'Загрузіць больш рэйсаў',
      filter: {
        call: 'Табліца фільтраў',
        title: 'Фільтр',
        aircraft: 'Самалёты',
        airline: 'Авіякампанія',
        origin: 'Origin',
        destination: 'Пункт прызначэння',
        showAvailableOnly: 'Паказаць толькі даступныя рэйсы',
        reset: 'Скінуць фільтры',
        apply: 'Ужыць фільтры'
      },
      error: {
        noFlightsFound: {
          title: 'Занадта позна 😓... Здаецца, для вас тут больш нічога...',
          subtitle: 'Дадзеныя могуць не існаваць у нашай сістэме. Праверце ўжытыя фільтры або паўтарыце спробу пазней.'
        },
        unableToBook: {
          title: 'Мы не можам забраніраваць гэты рэйс...',
          subtitle: 'Дадзеных можа не існаваць у нашай сістэме, або гэты рэйс ужо забраніраваў іншы пілот.'
        },
      }
    },
    notification: {
      scheduleConfirmation: {
        title: 'Вы ўпэўнены, што хочаце запланаваць гэты рэйс?',
        subtitle: 'Перш чым пацвердзіць, паглядзіце дэталі і пераканайцеся, што гэта той рэйс, які вам патрэбны.',
        alert: 'Планаванне не азначае, што ваш рэйс забраніраваны. Вы павінны пацвердзіць яго ад трох да сямі дзён да падзеі. Планаванне будзе адменена, калі вы не пацвердзіце яго па меншай меры за 72 гадзіны да вылету.',
        button: 'Запланаваць'
      },
      scheduled: {
        title: 'Рэйс запланаваны!',
        subtitle: 'Памятайце: вы павінны пацвердзіць яго за тры-сем дзён да мерапрыемства. Планаванне будзе адменена, калі вы не пацвердзіце па меншай меры за 72 гадзіны да вылету.'
      },
      booked: {
        title: 'Рэйс забраніраваны!',
        subtitle: 'Ваш рэйс пацверджаны. Падрыхтуйце план палёту і самалёт, пераканайцеся, што вы ведаеце час і нумар выхаду і, самае галоўнае, атрымлівайце задавальненне!',
      },
      cancelled: {
        title: 'Планаванне адменена!',
        subtitle: 'Ваша планаванне была адменена. Шкада, што вы сыходзіце... Можа, іншым разам?'
      }
    },
    myFlights: {
      title: 'Мае палёты',
      subtitle: 'Глядзіце ўсё сваё планаванне',
      search: 'Знайдзіце планаванне',
      pilotBriefing: {
        title: 'Брыфінг пілота',
        description: 'У гэтым дакуменце ўтрымліваюцца рэкамендацыі для пілотаў аб канкрэтных працэдурах для гэтай падзеі. Неабходна прачытаць.',
      },
      boardingPass: {
        cancelFlight: 'Адмяніць рэйс',
        cancelFlightConfirmation: 'Вы ўпэўнены, што хочаце адмяніць гэты рэйс?',
        confirmFlight: 'Пацвердзіць рэйс',
        disclaimer: 'Каб прыняць удзел у падзеі, вы павінны выконваць усе інструкцыі, прадстаўленыя на брыфінгу пілота.',
        waitToConfirm: 'Пачакайце, каб пацвердзіць рэйс.'
      }
    },
    sidebarPanel: {
      information: 'Агульная інфармацыя',
      flights: 'Пошук рэйсаў',
      myFlights: 'Мае рэйсы',
      changeTheme: 'Змяніць бягучую тэму',
      logout: 'Выйсці з сістэмы',
      eventsHome: 'Перайсці да спісу падзей'
    }
  },
};

export default beTranslations;